<?php
include_once dirname(__FILE__) . '/../code/PEG.php';
include_once 'Benchmark/Timer.php';

/**
 * メモ化の有無での処理時間の差を見るサンプル
 * ここではメモ化するのとしないのとでは著しく違いが出る文法規則を元にパーサを組み立てている
 */

$t = new Benchmark_Timer;
$str = '((((((((1))))))))';


$t->start();

// メモ化していないパーサ
$a = PEG::ref();
$p = PEG::ref();
$a->is(PEG::choice(
    PEG::seq($p, '+', $a),
    PEG::seq($p, '-', $a),
    $p
));
$p->is(PEG::choice(
    PEG::seq('(', $a, ')'),
    '1'
));
$a->parse(PEG::context($str));
$t->setMarker('no memoize');

// メモ化しているパーサ
$a = PEG::ref();
$p = PEG::ref();
$a->is(PEG::memo(PEG::choice(
    PEG::seq($p, '+', $a),
    PEG::seq($p, '-', $a),
    $p
)));
$p->is(PEG::memo(PEG::choice(
    PEG::seq('(', $a, ')'),
    '1'
)));
$a->parse($c = PEG::context($str));
$t->setMarker('memoize');
$t->stop();
$t->display();

/* 結果
---------------------------------------------------------
marker       time index            ex time         perct   
---------------------------------------------------------
Start        1235989584.63519000   -                0.00%
---------------------------------------------------------
no memoize   1235989585.87348300   1.238293        99.89%
---------------------------------------------------------
memoize      1235989585.87478200   0.001299         0.10%
---------------------------------------------------------
Stop         1235989585.87479900   0.000017         0.00%
---------------------------------------------------------
total        -                     1.239609       100.00%
---------------------------------------------------------
 */